app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 22 Nov 2013 10:41:54 UTC +00:00], ["text", "asdf"], ["title", "asdf"], ["updated_at", Fri, 22 Nov 2013 10:41:54 UTC +00:00]]
---
  def create
    @post = Post.new(post_params)
    @post.save